In [22]:
import pandas as pd

In [15]:
#import file from C:\Users\sagni\Documents\Personal Files\CS7641\CS7641\Data\Bank_churn
data = pd.read_csv("C:/Users/sagni/Documents/Personal Files/CS7641/CS7641/Data/Bank_churn/train.csv")

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.0,2,1.0,0.0,181449.97,0
1,1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.0,2,1.0,1.0,49503.50,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165032,165032,15689614,Hsiung,554,Spain,Female,30.0,7,161533.0,1,0.0,1.0,71173.03,0
165033,165033,15732798,Ulyanov,850,France,Male,31.0,1,0.0,1,1.0,0.0,61581.79,1

In [123]:
%run Source_Be_With_Me.ipynb
eda(data)

Shape
Number of columns are 165034 and number of rows are 14

Sample rows - Top 5

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

EDA Statistics

,id,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,165034.00,1.65e+05,165034.00,165034.00,165034.00,165034.00,165034.00,165034.00,165034.0,165034.00,165034.00
mean,82516.50,1.57e+07,656.45,38.13,5.02,55478.09,1.55,0.75,0.5,112574.82,0.21
std,47641.36,7.14e+04,80.10,8.87,2.81,62817.66,0.55,0.43,0.5,50292.87,0.41
min,0.00,1.56e+07,350.00,18.00,0.00,0.00,1.00,0.00,0.0,11.58,0.00
25%,41258.25,1.56e+07,597.00,32.00,3.00,0.00,1.00,1.00,0.0,74637.57,0.00
50%,82516.50,1.57e+07,659.00,37.00,5.00,0.00,2.00,1.00,0.0,117948.00,0.00
75%,123774.75,1.58e+07,710.00,42.00,7.00,119939.52,2.00,1.00,1.0,155152.47,0.00
max,165033.00,1.58e+07,850.00,92.00,10.00,250898.09,4.00,1.00,1.0,199992.48,1.00

Missing values

Series([], dtype: int64)

Count of Outliers

Age            313
Exited       34921
HasCrCard    40606
dtype: int64

In [124]:
trainX, trainY, testX, testY = stratified_sampling(data, 'Exited', 0.4, 903949505)

Original distribution

   counts      %
0  130113  78.84
1   34921  21.16

Train distribution

   counts      %
0   78067  78.84
1   20953  21.16

Test distribution

   counts      %
0   52046  78.84
1   13968  21.16

Train_x shape
Number of columns are 99020 and number of rows are 13

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
144865,144865,15642394,Tung,651,Spain,Female,34.0,2,0.00,2,1.0,1.0,100995.68
5644,5644,15809830,Manna,745,France,Male,38.0,5,0.00,1,1.0,0.0,96670.20
105829,105829,15622182,Daniels,574,Germany,Female,35.0,1,99774.50,1,0.0,0.0,4896.11
116624,116624,15574072,Hsiao,760,Germany,Female,33.0,3,121593.18,2,1.0,0.0,123086.59
160685,160685,15696552,Nnamutaezinwa,652,Spain,Female,36.0,1,0.00,2,1.0,1.0,44215.86

Train_y shape
Number of columns are 99020 and number of rows are 1

        Exited
144865       0
5644         0
105829       0
116624       0
160685       0

Train_x shape
Number of columns are 66014 and number of rows are 13

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
62827,62827,15804937,Cambage,702,France,Male,37.0,8,0.00,2,0.0,0.0,94949.84
137573,137573,15640953,McIntyre,716,Spain,Female,50.0,10,0.00,1,0.0,0.0,163427.18
151346,151346,15578865,Ting,850,France,Female,34.0,6,0.00,2,1.0,1.0,114448.13
75365,75365,15815645,Akhtar,809,France,Male,37.0,8,152303.66,2,1.0,1.0,175082.20
23180,23180,15797767,Yobachi,641,Spain,Female,34.0,5,0.00,2,1.0,1.0,92915.84

Train_y shape
Number of columns are 66014 and number of rows are 1

        Exited
62827        0
137573       1
151346       0
75365        0
23180        0